<?php 

/***************************************************************************************************************************************************************************
 * Singleton                                                                                                                                                               *
 * *************************************************************************************************************************************************************************
 * Гарантирует наличие экземпляра класса                                                                                                                                   *
 * Предоставляет глобальную точку доступа                                                                                                                                  *
 *                                                                                                                                                                         *
 * Реализация: Конструктор скрыт по умолчанию, создается публичный статический метод который и будет контролировать жизненный цикл объекта-одиночки                        *
 * Структура: В классе должнен быть метод getinstance(), который возвращает единственный экземпляр класса Singleton. Конструктор класса должен быть скрыть от клиента,     *
 * вызов функции getinstance() должен быть единсвенным способом получить экземпляр класса.
 **************************************************************************************************************************************************************************/

 class Settings
 {
     // Заводим статическую переменную, которая будет хранить экземпляр нашего класса
     private static $_instance = null;

     private function __construct(){}

     private function __clone(){} 

     public static function getinstance(){
         if(self::$_instance == null){
                self::$_instance = new Settings();
         }
         return self::$_instance;
     }
     
     public function test(){
         var_dump($this);
     }
 }